# parameters
nc: 1  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple

# anchors
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 6, 2, 2]],   # 0-P1/2
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4
   [-1, 3, C3, [128]],
   [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8
   [-1, 6, C3, [256]],
   [-1, 1, Conv, [512, 3, 2]],  # 5-P4/16
   [-1, 9, C3, [512]],
   [-1, 1, Conv, [1024, 3, 2]],  # 7-P5/32
   [-1, 3, C3, [1024, True]],  # 8 
   [-1, 1, CEM_CoorATT, [1024, [1, 3, 5]]], # 9
  ]

# YOLOv5 head
head:
  [[-1, 1, Conv, [512, 1, 1]], # 10
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1,6], 1, Weighted_add, [256,256]],  # Add backbone P4
   [-1, 3, C3, [512, False]],  # 13

   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 4], 1, Weighted_add, [128,128]],  #16 Add backbone P3
 
 

   [-1, 1, Conv, [256, 3, 2]],   
   [-1, 1, Conv, [256, 3, 2]],    
   [-1, 3, C3TR, [256, False]],  
   [-1, 1, nn.Upsample, [None, 4, 'nearest']], 
   [-1, 1, FEM, [256]], # 21

   [-1, 1, C3, [256, False]],  # 22 (P3/8-small)

   [-1, 1, Conv, [512, 3, 2]],   # 23
   [[-1, 13], 1, Weighted_add, [256,256]],  # Add head P4

   [-1, 1, FEM_s, [512]], # 25
   [-1, 3, C3, [512, False]],  # 26 (P4/16-medium)

   [-1, 1, Conv, [1024, 3, 2]], # 27
   [[-1, 9], 1, Weighted_add, [512, 512]],  # Add head P5 28
    
   [-1, 1, FEM_s, [1024]], # 29

   [-1, 3, C3, [1024, False]],  # 30 (P5/32-large) #

   [[22, 26, 30], 1, ASFF_Detect, [nc, anchors, 0.5, True]],  # Detect(P3, P4, P5)
  ]
